CSI API ETABS v1

# cEditGeneral Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cEditGeneral

    Public Interface cEditGeneral

    Dim instance As cEditGeneral

    public interface class cEditGeneral

    type cEditGeneral =  interface end

The cEditGeneral type exposes the following members.

Methods

| Name| Description
---|---|---
|
Move|  Moves selected point,
frame, cable, tendon, area, solid and link objects.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com